Repository: DevCrew-io/2checkout-flutter
Catalog: ios/Classes/Verifone2CO/Localizations/*.lproj/Localizable.strings
Languages: ar, da, de, et, fi, fr, he, is, lt, lv, nn, pl

# cardExpired
source: Card is expired
ar: بطاقة منتهية الصلاحية
da: Kortet er udløbet
de: Die Karte ist abgelaufen
et: Kaart on aegunud
fi: Kortti on vanhentunut
fr: Carte expirée
he: פג תוקף הכרטיס
is: Kort er útrunnið
lt: Kortelės galiojimo laikas baigėsi
lv: Kartes derīguma termiņš ir beidzies
nn: Kortet er utløpt
pl: Karta straciła ważność

# cardExpiryDateFormat
source: Invalid date. Format: mm/yy
ar: تاريخ غير صحيح. النسق = شش/سس
da: Ugyldig dato. Format = mm/åå
de: Ungültiges Datum. Format = mm/jj
et: Ebakorrektne kuup채ev. Vorming = kk/pp
fi: Virheellinen päivämäärä. Muoto = kk/vv
fr: Date non valide. Format = mm/aa
he: תאריך לא חוקי. פורמט = mm/yy
is: Ógild dagsetning. Snið = mm/áá
lt: Netinkama data. Formatas = mm/yy
lv: Nederīgs datums. Formāts = mm/gg
nn: Ugyldig dato. Format = mm/åå
pl: Nieprawidłowa data. Format = mm/rr

# cardExpiryLabel
source: Expiration date
ar: الانتهاء
da: Udløbsdato
de: Ablaufdatum
et: Aegumiskuup채ev
fr: Date d'expiration
he: תאריך תפוגה
is: Gildistími
lt: Galiojimo pabaigos data
lv: Termiņš
nn: Utløp
pl: Data ważności

# cardNumberLabel
source: Card number
ar: رقم البطاقة
da: Kortnummer
de: Kartennummer
et: Kaardi number
fi: Kortin numero
fr: Numéro de carte
he: מספר הכרטיס
is: Kortanúmer
lt: Kortelės numeris
lv: Kartes numurs
nn: Kortnummer
pl: Numer karty

# cardNumberPlaceholder
source: Your card number
ar: رقم بطاقتك
da: Dit kortnummer
de: Ihre Kartennummer
et: Sinu kaardi number
fi: Korttisi numero
fr: Numéro de votre carte
he: מספר הכרטיס שלך
is: Kortanúmerið þitt
lt: Jūsų kortelės numeris
lv: Jūsu kartes numurs
nn: Ditt kortnummer
pl: Numer Twojej karty

# cardTitle
source: Credit card
ar: بطاقة الائتمان
da: Kreditkort
de: Kreditkarte
et: Krediitkaart
fi: Luottokortti
fr: Carte de crédit
he: כרטיס אשראי
is: Kreditkort
lt: Kredito kortelė
lv: Kredītkarte
nn: Kredittkort
pl: Karta kredytowa

# cvvLabel
source: CVV
ar: الرمز الأمني للبطاقة (CVV)
is: CCV

# cvvNotValid
source: CVV number is not valid
ar: رقم الرمز الأمني للبطاقة (CVV) غير صحيح
da: CVV-nummeret er ikke gyldigt
de: Die CVV-Nummer ist ungültig
et: CVV-kood on vale
fi: CVV-numero on virheellinen
fr: Le CVV est incorrect
he: מספר CVV אינו חוקי
is: CCV númer ekki gilt
lt: CVV kodas negalioja
lv: CVV numurs nav derīgs
nn: Ugyldig CVV-nummer
pl: Numer CVV jest nieprawidłowy

# cvvPlaceholder3
source: CVV
ar: الرمز الأمني للبطاقة (CVV)
is: CCV

# cvvPlaceholder4
source: CVV
ar: الرمز الأمني للبطاقة (CVV)
is: CCV

# expiryPlaceholder
source: MM/YY
ar: شش/سس
da: MM/ÅÅ
de: MM/JJ
et: KK/AA
fi: KK/VV
fr: MM/AA
is: MM/ÁÁ
lt: MĖNUO/METAI
lv: MM/GG
nn: MM/ÅÅ
pl: MM/RR

# footerText
source: Secure payments provided by
ar: مدفوعات آمنة من Verifone
da: Sikre betalinger leveret af Verifone
de: Sichere Zahlungen; bereitgestellt von Verifone
et: Verifone'i turvalised maksed
fi: Suojatut maksut tarjoaa Verifone
fr: Paiements sécurisés fournis par Verifone
he: תשלומים מאובטחים על ידי Verifone
is: Öruggar greiðslur hjá Verifone
lt: Saugūs mokėjimai iš „Verifone“
lv: Drošie maksājumi; ko nodrošina Verifone
nn: Sikre betalinger tilbudt av Verifone
pl: Bezpieczne płatności za pośrednictwem Verifone

# languageName
source: English
ar: الإنجليزية
da: Dansk
de: Deutsche
et: Eesti
fi: Suomi
fr: Français
he: עברית
is: Íslenska
lt: Lietuvių
lv: Latviešu
nn: Norsk
pl: Polski

# lengthNotValid
source: Card number length is not valid
ar: طول رقم البطاقة غير صحيح
da: Kortnummerets længde er ikke gyldig
de: Die Länge der Kartennummer ist ungültig
et: Kaardi numbri pikkus ei sobi
fi: Kortin numero ei ole oikean pituinen
fr: La longueur du numéro de carte est incorrecte
he: אורך מספר הכרטיס אינו חוקי
is: Lengd kortanúmers er ekki gild
lt: Kortelės numerio ilgis neteisingas
lv: Kartes numura garums nav derīgs
nn: Ugyldig kortnummerlengde
pl: Długość numeru karty jest nieprawidłowa

# monthNotValid
source: Expiration month must be a value between 1 and 12
ar: يجب أن يكون شهر الانتهاء بقيمة تتراوح بين 1 و 12
da: Udløbsmåneden skal være en værdi mellem 1 og 12
de: Der Monat des Ablaufdatums muss ein Wert zwischen 1 und 12 sein
fi: Vanhenemiskuukauden on oltava arvo väliltä 1 ja 12
fr: Le mois d'expiration doit être compris entre 1 et 12
he: חודש פקיעת התוקף חייב להיות ערך בין 1 ל-12
is: Gildismánuður verður að vera gildi á bilinu 1 til 12
lt: Galiojimo pabaigos mėnesio vertė turi būti nuo 1 iki 12
lv: Termiņa beigu mēnesim jābūt vērtībai starp 1 un 12
nn: Utløpsmåned må være en verdi mellom 1 og 12
pl: Miesiąc ważności musi być wartością od 1 do 12

# nrNotValid
source: Card number is not valid
ar: رقم البطاقة غير صحيح
da: Kortnummeret er ikke gyldigt
de: Die Kartennummer ist ungültig
et: Kaardi number on vale
fi: Kortin numero on virheellinen
fr: Le numéro de la carte est incorrect
he: מספר הכרטיס אינו חוקי
is: Kortanúmer er ekki gilt
lt: Kortelės numeris neteisingas
lv: Kartes numurs nav derīgs
nn: Ugyldig kortnummer
pl: Numer karty jest nieprawidłowy

# submitPay
source: Pay
ar: دفع
da: Betal
de: Zahlen
et: Maksa
fi: Maksa
fr: Payer
he: בצע תשלום
is: Greiða
lt: Mokėti
lv: Maksāt
nn: Betal
pl: Zapłać

# submitTitle
source: Confirm
ar: تأكيد
da: Bekræft
de: Bestätigen
et: Kinnita
fi: Vahvista
fr: Valider
he: אשר
is: Staðfesta
lt: Patvirtinti
lv: Apstiprināt
nn: Bekreft
pl: Potwierdź

# yearNotValid
source: Expiration year cannot exceed
ar: لا يُمكن أن تتجاوز سنة الانتهاء
da: Udløbsåret må ikke overstige
de: Das Jahr des Ablaufdatums darf nicht später sein als
et: Aegumisaasta ei saa olla hilisem kui
fi: Vanhenemisvuosi ei voi ylittää vuotta
fr: L'année d'expiration ne peut pas dépasser
he: אין לחרוג משנת פקיעת התוקף
is: Gildisár má ekki vera of langt
lt: Galiojimo pabaigos metai negali būti vėlesni negu
lv: Termiņa beigu gads nedrīkst pārsniegt
nn: Utløpsår kan ikke overskride
pl: Rok ważności nie może przekraczać

# customerText
source: Customer
ar: الزبون
da: Kunde
de: Kunde
et: Klient
fi: Asiakas
fr: Client
he: לקוח
is: Viðskiptavinur
lt: Klientas
lv: Klients
nn: Kunde
pl: Klient

# paymentSelectTitle
source: Select payment method
ar: اختر طريقة الدفع
da: Vælg betalingsmetode
de: Zahlungstyp auswählen
et: Vali makseviis
fi: Valitse maksutapa
fr: Sélectionner un moyen de paiement
he: בחר אמצעי תשלום
is: Velja greiðslumáta
lt: Pasirinkti mokėjimo metodą
lv: Izvēlēties maksājuma veidu
nn: Vis betalingsmetode
pl: Wybierz metodę płatności

# paymentProductCard
source: Credit card
ar: بطاقة ائتمان
da: Kreditkort
de: Kreditkarte
et: Krediitkaart
fi: Luottokortti
fr: Carte de crédit
he: כרטיס אשראי
is: Kreditkort
lt: Kredito kortelė
lv: Kredītkarte
nn: Kredittkort
pl: Karta kredytowa

# paymentProductCrypto
source: Crypto
et: Kr체pto
fi: Krypto
he: קריפטו
is: Rafmynt
lt: Kripto
pl: Kryptowaluta

# transactionIncorrectCardInformation
source: Incorrect Card information
ar: معلومات البطاقة غير صحيحة
da: Forkert kortinformation
de: Kartenangaben falsch
et: Valed kaardiandmed
fi: Virheelliset korttitiedot
fr: Informations sur la carte incorrectes
he: פרטי הכרטיס שגויים
is: Rangar kortaupplýsingar
lt: Netinkama kortelės informacija
lv: Nepareiza kartes informācija
nn: Feil kortinformasjon
pl: Nieprawidłowe dane karty

# transactionIncorrectCVV
source: Incorrect CVV
ar: رمز CVV غير صحيح
da: Forkert CVV
de: CVV (Sicherheitscode) falsch
et: Vale CVV
fi: Virheellinen CVV
fr: CVV incorrect
he: הקוד הסודי שגוי
is: Rangt CVV
lt: Netinkamas CVV
lv: Nepareizs CVV
nn: Feil CVC-kode
pl: Nieprawidłowy kod CVV

# cancelButtonText
source: Return to store
ar: عودة إلى المتجر
da: Tilbage til butik
de: Zurück zur Filiale
et: Tagasi poodi
fi: Palaa kauppaan
fr: Retour à la boutique
he: החזר לחנות
is: Til baka í verslun
lt: Grąžinti parduotuvę
lv: Atgriezties veikalā
nn: Tilbake til butikken
pl: Wróć do sklepu
